<?php
// กำหนดค่าการเชื่อมต่อฐานข้อมูล
$servername = "61.19.146.46";
$username = "root";
$password = "msh11195";
$dbname = "risk_db";

// สร้างการเชื่อมต่อ
$conn = new mysqli($servername, $username, $password, $dbname);

// ตรวจสอบการเชื่อมต่อ
if ($conn->connect_error) {
    // ถ้ามีข้อผิดพลาดในการเชื่อมต่อ แสดงข้อความข้อผิดพลาด
    die("การเชื่อมต่อล้มเหลว: " . $conn->connect_error);
} else {
    echo "การเชื่อมต่อฐานข้อมูลสำเร็จ!";
}

// ถ้าการเชื่อมต่อสำเร็จ
// echo "การเชื่อมต่อฐานข้อมูลสำเร็จ!";  // สามารถลบออกหรือใช้สำหรับการทดสอบ
?>
